---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AutoJoinConditionWall
source: html/f2f3fe13-2ef8-d526-d4df-21910541ddbc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AutoJoinConditionWall Property

"Join Condition"

## Syntax (C#)
```csharp
public static ForgeTypeId AutoJoinConditionWall { get; }
```